app/controllers/prototypes_controller.rb

  def index
    @prototypes = Prototype.all
---
SELECT `prototypes`.* FROM `prototypes`